/*************************************************************************
 * "driver" for the Force SIO-2 board under VxWorks
 *  Tom Trebisky 3/6/90	Steward Observatory
 *************************************************************************/

/* VxWorks include files */
#include "vxWorks.h"
#include "iosLib.h"
#include "stdioLib.h"
#include "semLib.h"
#include "vme.h"
#ifdef VX4
#include "iv68k.h"
#else
#include "iv.h"
#endif
#include "setjmp.h"

/*
#define PARITY
#define TEST
*/
#define PARITY

#ifdef TEST
jmp_buf userenv;
#endif


/************************************************************************
 * The following C structure gives the register layout for a
 * MC68230 PIT chip accessed from a 16 bit bus
 *
 * On the Force SIO board, this chip is used in a "minimal" fashion.
 * All pins on port C are simply pulled up and not connected to anything
 * (thus no timer interrupts and such), The timer could be set to run off
 * the Clock (8.064Mhz), but would need to be "polled" by the cpu.
 * The intent of this chip is just to use ports A and B in a dedicated
 * fashion to control various aspects of the MPCC operation.
 *	(See below)
 *************************************************************************/

struct pit {
/*00*/	unsigned char dum0, pgcr;	/* Port general control register */
/*02*/	unsigned char dum1, psrr;	/* Port service request */
/*04*/	unsigned char dum2, paddr;	/* Port A data direction */
/*06*/	unsigned char dum3, pbddr;	/* Port B data direction */
/*08*/	unsigned char dum4, pcddr;	/* Port C data direction */
/*0a*/	unsigned char dum5, pivr;	/* Port interrupt vector */
/*0c*/	unsigned char dum6, pactl;	/* Port A control */
/*0e*/	unsigned char dum7, pbctl;	/* Port B control */
/*10*/	unsigned char dum8, padata;	/* Port A data */
/*12*/	unsigned char dum9, pbdata;	/* Port B data */
/*14*/	unsigned char duma, paalt;	/* Port A alternate data */
/*16*/	unsigned char dumb, pbalt;	/* Port B alternate data */
/*18*/	unsigned char dumc, pcdata;	/* Port C data */
/*1a*/	unsigned char dumd, pstat;	/* Port status */
/*--*/	unsigned char space0, space1;	/* --- */
/*--*/	unsigned char space2, space3;	/* --- */
/*20*/	unsigned char zum0, tcr;	/* Timer control register */
/*22*/	unsigned char zum1, tivr;	/* Timer interrupt vector */
/*--*/	unsigned char zum2, null0;	/* --- */
/*26*/	unsigned char zum3, cprh;	/* Timer: counter preload high */
/*28*/	unsigned char zum4, cprm;	/* Timer: counter preload middle */
/*2a*/	unsigned char zum5, cprl;	/* Timer: counter preload low */
/*--*/	unsigned char zum6, null1;	/* --- */
/*2e*/	unsigned char zum7, cnth;	/* Timer: counter high */
/*30*/	unsigned char zum8, cntm;	/* Timer: counter middle */
/*32*/	unsigned char zum9, cntl;	/* Timer: counter low */
/*34*/	unsigned char zuma, tsr;	/* Timer: status */
};

#define DD_OUTS	0xff		/* data direction: output on all 8 pins */
#define DD_INS	0x00		/* data direction: input on all 8 pins */
/* In this hardware configuration, using ports A or B as inputs would not
 * do anything useful */

#define RCV_ON	0x3f		/* gate on all 6 receivers */
#define USE_422	0x3f		/* select RS422 drivers */
#define USE_232	0x00		/* select RS232 drivers */
#define USE_OPTO	0x00	/* select OPTO drivers (SIO_2A ch. 1&2 only) */
#define NO_OPTO		0xc0	/* NO OPTO drivers (SIO_2A ch. 1&2 only) */

/************************************************************************
 * The following C structure gives the register layout for a
 * Rockwell R68561 MPCC chip in 8 bit mode accessed from a 16 bit bus
 * in the wierd interleaving used on the Force SIO board.
 *************************************************************************/

struct bmpcc {
/*00*/	unsigned char dum0, rsr;	/* receiver status register */
/*02*/	unsigned char dum1, rdat;	/* receiver data register */
/*04*/	unsigned char dum2, riv;	/* receiver interrupt vector */
/*06*/	unsigned char dum3, pad0;	/* --- */
/*08*/	unsigned char dum4, tsr;	/* transmitter status register */
/*0a*/	unsigned char dum5, tdat;	/* transmitter data register */
/*0c*/	unsigned char dum6, tiv;	/* transmitter interrupt vector */
/*0e*/	unsigned char dum7, pad1;	/* --- */
/*10*/	unsigned char dum8, sisr;	/* serial status register */
/*12*/	unsigned char dum9, pad2;	/* --- */
/*14*/	unsigned char du10, siv;	/* serial interrupt vector */
/*16*/	unsigned char du11, pad3;	/* --- */
/*18*/	unsigned char du12, psr1;	/* protocol select (1) */
/*1a*/	unsigned char du13, addr1;	/* address register (1) */
/*1c*/	unsigned char du14, baud1;	/* baud rate register (1) */
/*1e*/	unsigned char du15, ccr;	/* clock control register */
/*20*/	unsigned char du16, rcr;	/* receiver control register */
/*22*/	unsigned char du17, pad4;	/* --- */
/*24*/	unsigned char du18, rier;	/* receiver interrupt enable */
/*26*/	unsigned char du19, pad5;	/* --- */
/*28*/	unsigned char du20, tcr;	/* transmitter control register */
/*2a*/	unsigned char du21, pad6;	/* --- */
/*2c*/	unsigned char du22, tier;	/* transmitter interrupt enable */
/*2e*/	unsigned char du23, pad7;	/* --- */
/*30*/	unsigned char du24, sicr;	/* serial control register */
/*32*/	unsigned char du25, pad8;	/* --- */
/*34*/	unsigned char du26, sier;	/* serial interrupt enable */
/*36*/	unsigned char du27, pad9;	/* --- */
/*38*/	unsigned char du28, psr2;	/* protocol select (2) */
/*3a*/	unsigned char du29, addr2;	/* address register (2) */
/*3c*/	unsigned char du30, baud2;	/* baud rate register (2) */
/*3e*/	unsigned char du31, ecr;	/* error control register */
/*40*/
};

/*
 * This C structure gives the register layout for a
 * Rockwell R68561 MPCC chip accessed from a 16 bit bus.
 * I have had nothing but trouble with this 16 bit mode, and I think
 * that trying to use this thing in word mode with asynchronous protocols
 * is off-the-wall anyhow.
 */
struct wmpcc {
/*00*/	short	mpcc_pad8[16];	/* unused addresses in 16 bit mode */ 
/*20*/	short	mpcc_rcsr;	/* receiver control and status */
/*22*/	short	mpcc_rdat;	/* receiver data (16 bit) */
/*24*/	short	mpcc_rir;	/* receiver interrupt */
/*26*/	short	mpcc_rpad;	/* --- */
/*28*/	short	mpcc_tcsr;	/* transmitter control and status */
/*2a*/	short	mpcc_tdat;	/* transmitter data (16 bit) */
/*2c*/	short	mpcc_tir;	/* transmitter interrupt */
/*2e*/	short	mpcc_tpad;	/* --- */
/*30*/	short	mpcc_scsr;	/* handshake control and status */
/*32*/	short	mpcc_pad2;	/* --- */
/*34*/	short	mpcc_sir;	/* handshake interrupt */
/*36*/	short	mpcc_pad3;	/* --- */
/*38*/	short	mpcc_prot;	/* protocol selection */
/*3a*/	short	mpcc_addr;	/* address (synchronous protocols) */
/*3c*/	short	mpcc_baud;	/* baud rate generator control */
/*3e*/	short	mpcc_eccr;	/* error & clock control */
/*40*/
};

/* for word mode, we only need to define different bits for the
 * registers which are in the even (upper) byte, for those in the
 * odd (lower) byte, the byte mode definitions work too.
 */

/* bits in the transmitter csr */
#define WTCR_ENA	0x8000	/* enable transmitter */
#define	WTCR_ICS	0x2000	/* yank high to generate break */
#define	WTCR_THW	0x1000	/* transmit half word (flush odd byte) */
#define	WTCR_RESET	0x0100	/* reset transmitter */

/* bits in the receiver csr */
#define WRCR_RESET	0x0100	/* reset receiver */

/* bits in the serial interface csr */
#define WSI_RTS		0x8000	/* RTS level */
#define WSI_DTR		0x4000	/* DTR level */
#define WSI_ECHO	0x0400	/* echo control */
#define WSI_TEST	0x0200	/* loopback test mode */

/* bits in the error control register (upper byte of mpcc_eccr) */
#define WEC_PAR		0x8000
#define WEC_ODD		0x4000
#define WEC_EVEN	0x0000
    /* other bits control CRC generator */

/* bits in the protocol select register (PSR2-PSR1) */
#define WPR_BY		0x0000	/* first time only, to get 8 bit mode */
#define WPR_WD		0x8000	/* run in 16 bit (word) mode */
#define WPR_ST1		0x0000	/* 1 stop bit */
#define WPR_STH		0x2000	/* 1.5 stop bit */
#define WPR_ST2		0x4000	/* 2 stop bit */
#define WPR_CH7		0x1000	/* 7 bit characters */
#define WPR_CH8		0x1800	/* 8 bit characters */
    /* any parity generated/checked is in addition to this */
#define WPR_ASY		0x0600	/* asynch protocol (not BOP, synch, ...) */

/* interrupt mask bits (set to enable) follow */
#define RIE_DA		0x80	/* receiver data available */
#define RIE_EOF		0x40	/* end of frame */
#define RIE_CPERR	0x10	/* CRC/Parity error */
#define RIE_FRERR	0x08	/* frame error */
#define RIE_OVRN	0x04	/* receiver overrun */
#define RIE_AB		0x02	/* receiver abort/break */

#define TIE_DRA		0x80	/* transmitter data register available */
#define TIE_FC		0x40	/* transmit frame complete */
#define TIE_UNRN	0x04	/* transmitter underrun */
#define TIE_FERR	0x02	/* transmit frame error */

#define SIE_CTS		0x80	/* CTS */
#define SIE_DSR		0x40	/* DSR */
#define SIE_DCD		0x20	/* DCD */

/** 8-bit bit definitions follow: **/

/* bits in the transmitter csr */
#define TCR_ENA		0x80	/* enable transmitter */
#define	TCR_ICS		0x20	/* yank high to generate break */
#define	TCR_THW		0x10	/* transmit half word (flush odd byte) */
#define	TCR_RESET	0x01	/* reset transmitter */

#define TSR_TDRA	0x80	/* transmitter data reg. available */

/* bits in the receiver csr */
#define RCR_RESET	0x01	/* reset receiver */

#define RSR_RDA		0x80	/* data available */
#define RSR_CPERR	0x10	/* crc/parity error */
#define RSR_FERR	0x08	/* framing error */
#define RSR_OVRN	0x04	/* overrun */

/* bits in the serial interface control register */
#define SI_RTS		0x80	/* RTS level */
#define SI_DTR		0x40	/* DTR level */
#define SI_ECHO		0x04	/* echo control */
#define SI_TEST		0x02	/* loopback test mode */

/* bits in the serial status register */
#define SS_TCTS		0x80	/* CTS transition */
#define SS_TDSR		0x40	/* DSR transition */
#define SS_TDCD		0x20	/* DCD transition */
#define SS_CTS		0x10	/* CTS level */
#define SS_DSR		0x08	/* DSR level */
#define SS_DCD		0x04	/* DCD level */

/* bits in the error control register */
#define EC_PAR		0x80
#define EC_ODD		0x40
#define EC_EVEN		0x00
#define EC_CRC0		0x04

/* bits in the clock control register */
#define PSCDV2		0x00
#define PSCDV3		0x10
#define TXCOUT		0x08	/* use internal clock for TxC */
#define RXCINT		0x04	/* use internal clock for RxC */

/* bits in the protocol select register */
#define PR1_CTLEX	0x02	/* BOP only - select 16 bit control field */
#define PR1_ADDEX	0x01	/* BOP only - enable address extension */

#define PR2_BY		0x00	/* first time only, to get 8 bit mode */
#define PR2_WD		0x80	/* select 16 bit mode (LOOK out!) */
#define PR2_ST1		0x00	/* 1 stop bit */
#define PR2_STH 	0x20	/* 1.5 stop bit */
#define PR2_ST2		0x40	/* 2 stop bit */
#define PR2_CH7		0x10	/* 7 bit characters */
#define PR2_CH8		0x18	/* 8 bit characters */
    /* any parity generated/checked is in addition to these data bits */
#define PR2_ASY		0x06	/* asynch protocol (not BOP, synch, ...) */

#ifdef PARITY
#define PR2_ASYNC	(PR2_BY|PR2_ST1|PR2_CH7|PR2_ASY)
#else
#define PR2_ASYNC	(PR2_BY|PR2_ST1|PR2_CH8|PR2_ASY)
#endif

/*************************************************************************
 * That ends the chip-level definitions, now on to the board and system level.
 *************************************************************************/

/* Testing was done with a single board, and with the first channel on
 * that board for the most part.
 * I am told that in the final configuration we will have three boards
 * with three channels used from each (for redundancy/reliability).
 * So we want logical channel 3 (of 0,1,2,3) to be channel 0 on board 1.
 * Nothing has been specified about the "extra" 9 channels, so I will set
 * them up to be channels 9, 10, ..., 17.  This is done thru chmap, which
 * maps board and chip number to logical channel number.  After initialization
 * we don't know or care how they were mapped, we just lookup the uart base
 * address in chtab[] and go.
 * My sympathy for whoever has to hook up the cables and wonder why
 * it was done like this, but:
 * (a) It wasn't my idea.   and   (b) There are reasons for it.
 */

#define MAXBOARDS	3	/* number of boards */
#define NSIOCHAN	6	/* channels per board */
#define MAXCHAN		(MAXBOARDS*NSIOCHAN)	/* (for all boards) */

static char chmap[MAXBOARDS][NSIOCHAN] = 
	{ 0, 1, 2, 9, 10, 11,
	  3, 4, 5, 12, 13, 14,
	  6, 7, 8, 15, 16, 17 };

/* Now the issue of board addresses -
/* The vme147 has on-board RAM from 0x0 -- 0x00800000 (8Mb)
 * so, the SIO jumpers must be set to place it beyond RAM.
 * With other CPU boards this would not be so.
 * This card is an A24/D16 slave, factory setting is 0xb00000.
 * The following array holds the jumpered addresses, we let VxWorks
 * map them into logical addresses for us ( 1:1 for the vme147).
 */

char *boards[] = { (char *) 0xb00000, (char *) 0xb00200, (char *) 0xb00400 };

#define BSPACE	VME_AM_STD_USR_DATA

/* This structure covers a whole SIO board */

struct sio {
/*000*/	struct bmpcc	sio_mpcc0;
/*040*/	struct bmpcc	sio_mpcc1;
/*080*/	struct bmpcc	sio_mpcc2;
/*0c0*/	struct bmpcc	sio_mpcc3;
/*100*/	struct bmpcc	sio_mpcc4;
/*140*/	struct bmpcc	sio_mpcc5;
/*180*/	struct pit	sio_pit;
/*1b6*/	/* END */
};

#define	OBUFSIZE  64
#define	IBUFSIZE  64

struct siochan {
	char	s_obuf[OBUFSIZE];
	char	s_ibuf[IBUFSIZE];
	struct bmpcc *s_uart;
	char	*s_optr;
	char	*s_oend;	/* past last character to go out */
	char	*s_iptr;
	int	s_flags;
};

struct siochan chtab[MAXCHAN];

#ifdef PARITY
#ifdef TEST
int perrs = 0;	/* count of parity errors */
int pchar = 0;	/* last bad parity character */
int ppos = 0;	/* location of last bad parity byte */
#endif
#endif

/* here are the flag bits in s_flags */
#define S_OPEN	0x8000	/* this channel is open (validly initialized) */
#define S_TBSY	0x4000	/* transmitter is busy (data in queue) */
#define S_WRAP	0x2000	/* input has wrapped around (circular buffer) */
#define S_RIO	0x1000	/* set if any Rx interrupts (debugging) */
#define S_CONN	0x0800	/* this channel is connected (via phw_init) */


/*************************************************************************
